renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/7_SPI_driver/Examples/SPI_Example4_SyncTxRx_2Ch_2Job_1Seq/Autosar/Mcal/Base/header/S32K142_M4.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>NXP Semiconductors</vendor>
  <name>S32K142_M4</name>
  <version>1.1</version>
  <description>S32K142_M4 NXP Microcontroller</description>
  <licenseText>
Copyright 2016-2022 NXP

NXP Confidential. This software is owned or controlled by NXP and may only be 
used strictly in accordance with the applicable license terms. By expressly 
accepting such terms or by downloading, installing, activating and/or otherwise 
using the software, you are agreeing that you have read, and that you agree to 
comply with and are bound by, such license terms. If you do not agree to be 
bound by the applicable license terms, then you may not retain, install, 
activate or otherwise use the software. The production use license in 
Section 2.3 is expressly granted for this software.
  </licenseText>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>AIPS</name>
      <description>AIPS</description>
      <groupName>AIPS</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPRA</name>
          <description>Master Privilege Register A</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C360000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MPL2</name>
              <description>Master 2 Privilege Level</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL2_0</name>
                  <description>Accesses from this master are forced to user-mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL2_1</name>
                  <description>Accesses from this master are not forced to user-mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTW2</name>
              <description>Master 2 Trusted For Writes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTW2_0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW2_1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTR2</name>
              <description>Master 2 Trusted For Read</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR2_0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR2_1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPL1</name>
              <description>Master 1 Privilege Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL1_0</name>
                  <description>Accesses from this master are forced to user-mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1_1</name>
                  <description>Accesses from this master are not forced to user-mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTW1</name>
              <description>Master 1 Trusted for Writes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTW1_0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW1_1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTR1</name>
              <description>Master 1 Trusted for Read</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR1_0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR1_1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPL0</name>
              <description>Master 0 Privilege Level</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MPL0_0</name>
                  <description>Accesses from this master are forced to user-mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL0_1</name>
                  <description>Accesses from this master are not forced to user-mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTW0</name>
              <description>Master 0 Trusted For Writes</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTW0_0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW0_1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTR0</name>
              <description>Master 0 Trusted For Read</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR0_0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR0_1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PACRA</name>
          <description>Peripheral Access Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x54000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP1</name>
              <description>Trusted Protect</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP1_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP1</name>
              <description>Write Protect</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP1_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP1</name>
              <description>Supervisor Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP1_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP0</name>
              <description>Trusted Protect</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP0</name>
              <description>Write Protect</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP0_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP0</name>
              <description>Supervisor Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP0_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PACRB</name>
          <description>Peripheral Access Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44000400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP5</name>
              <description>Trusted Protect</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP5_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP5_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP5</name>
              <description>Write Protect</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP5_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP5_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP5</name>
              <description>Supervisor Protect</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP5_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP5_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP1</name>
              <description>Trusted Protect</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP1_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP1</name>
              <description>Write Protect</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP1_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP1</name>
              <description>Supervisor Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP1_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP0</name>
              <description>Trusted Protect</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP0</name>
              <description>Write Protect</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP0_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP0</name>
              <description>Supervisor Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP0_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
