renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/7_SPI_driver/Examples/SPI_Example4_SyncTxRx_2Ch_2Job_1Seq/Autosar/Mcal/Base/header/S32K142_M4.svd
        <register>
          <name>CTRL1_PN</name>
          <description>Pretended Networking Control 1 Register</description>
          <addressOffset>0xB00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCS</name>
              <description>Filtering Combination Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ID_filtering</name>
                  <description>Message ID filtering only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_payload_filtering</name>
                  <description>Message ID filtering and payload filtering</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_filtering_number</name>
                  <description>Message ID filtering occurring a specified number of times</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ID_payload_filtering_number</name>
                  <description>Message ID filtering and payload filtering a specified number of times</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDFS</name>
              <description>ID Filtering Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>match_exact</name>
                  <description>Match upon ID contents against an exact target value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_GTE</name>
                  <description>Match upon an ID value greater than or equal to a specified target value</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_LTE</name>
                  <description>Match upon an ID value smaller than or equal to a specified target value</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_range</name>
                  <description>Match upon an ID value inside a range, greater than or equal to a specified lower limit, and smaller than or equal to a specified upper limit</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLFS</name>
              <description>Payload Filtering Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>match_exact</name>
                  <description>Match upon a payload contents against an exact target value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_GTE</name>
                  <description>Match upon a payload value greater than or equal to a specified target value</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_LTE</name>
                  <description>Match upon a payload value smaller than or equal to a specified target value</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_range</name>
                  <description>Match upon a payload value inside a range, greater than or equal to a specified lower limit, and smaller than or equal to a specified upper limit</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMATCH</name>
              <description>Number of Messages Matching the Same Filtering Criteria</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>match_1</name>
                  <description>Received message must match the predefined filtering criteria for ID and/or PL once before generating a wakeup event.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_2</name>
                  <description>Received message must match the predefined filtering criteria for ID and/or PL twice before generating a wakeup event.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match_255</name>
                  <description>Received message must match the predefined filtering criteria for ID and/or PL 255 times before generating a wakeup event.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUMF_MSK</name>
              <description>Wake Up by Match Flag Mask Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Wakeup match event is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Wakeup match event is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTOF_MSK</name>
              <description>Wake Up by Timeout Flag Mask Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Timeout wakeup event is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Timeout wakeup event is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2_PN</name>
          <description>Pretended Networking Control 2 Register</description>
          <addressOffset>0xB04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATCHTO</name>
              <description>Timeout for No Message Matching the Filtering Criteria</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WU_MTC</name>
          <description>Pretended Networking Wake Up Match Register</description>
          <addressOffset>0xB08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MCOUNTER</name>
              <description>Number of Matches when in Pretended Networking</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUMF</name>
              <description>Wake Up by Match Flag Bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_match</name>
                  <description>No wakeup by match event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>match</name>
                  <description>Wakeup by match event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WTOF</name>
              <description>Wake Up by Timeout Flag Bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_wakeup</name>
                  <description>No wakeup by timeout event detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wakeup</name>
                  <description>Wakeup by timeout event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT_ID1</name>
          <description>Pretended Networking ID Filter 1 Register</description>
          <addressOffset>0xB0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLT_ID1</name>
              <description>ID Filter 1 for Pretended Networking filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT_RTR</name>
              <description>Remote Transmission Request Filter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>reject</name>
                  <description>Reject remote frame (accept data frame)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>accept</name>
                  <description>Accept remote frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLT_IDE</name>
              <description>ID Extended Filter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>standard</name>
                  <description>Accept standard frame format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>extended</name>
                  <description>Accept extended frame format</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT_DLC</name>
          <description>Pretended Networking DLC Filter Register</description>
          <addressOffset>0xB10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLT_DLC_HI</name>
              <description>Upper Limit for Length of Data Bytes Filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT_DLC_LO</name>
              <description>Lower Limit for Length of Data Bytes Filter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PL1_LO</name>
          <description>Pretended Networking Payload Low Filter 1 Register</description>
          <addressOffset>0xB14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_3</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_2</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_1</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_0</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PL1_HI</name>
          <description>Pretended Networking Payload High Filter 1 Register</description>
          <addressOffset>0xB18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_7</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_6</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 6.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_5</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_4</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT_ID2_IDMASK</name>
          <description>Pretended Networking ID Filter 2 Register / ID Mask Register</description>
          <addressOffset>0xB1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLT_ID2_IDMASK</name>
              <description>ID Filter 2 for Pretended Networking Filtering / ID Mask Bits for Pretended Networking ID Filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTR_MSK</name>
              <description>Remote Transmission Request Mask Bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>frame_type_no</name>
                  <description>The corresponding bit in the filter is &quot;don't care&quot;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>frame_type_yes</name>
                  <description>The corresponding bit in the filter is checked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDE_MSK</name>
              <description>ID Extended Mask Bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>frame_format_no</name>
                  <description>The corresponding bit in the filter is &quot;don't care&quot;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>frame_format_yes</name>
                  <description>The corresponding bit in the filter is checked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PL2_PLMASK_LO</name>
          <description>Pretended Networking Payload Low Filter 2 Register / Payload Low Mask register</description>
          <addressOffset>0xB20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_3</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_2</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_1</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_0</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PL2_PLMASK_HI</name>
          <description>Pretended Networking Payload High Filter 2 low order bits / Payload High Mask register</description>
          <addressOffset>0xB24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_7</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_6</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 6.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_5</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_4</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
