renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/7_SPI_driver/Examples/SPI_Example4_SyncTxRx_2Ch_2Job_1Seq/Autosar/Mcal/Base/header/S32K142_M4.svd
        <register>
          <name>ESR1</name>
          <description>Error and Status 1 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRINT</name>
              <description>Error Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates setting of any error bit in the Error and Status register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOFFINT</name>
              <description>Bus Off Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>FlexCAN module entered Bus Off state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>FlexCAN In Reception</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>FlexCAN is not receiving a message.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>FlexCAN is receiving a message.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTCONF</name>
              <description>Fault Confinement State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>error_active</name>
                  <description>Error Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error_passive</name>
                  <description>Error Passive</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bus_off</name>
                  <description>Bus Off</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>FlexCAN In Transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>transmit_message_no</name>
                  <description>FlexCAN is not transmitting a message.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>transmit_message_yes</name>
                  <description>FlexCAN is transmitting a message.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>IDLE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>can_bus_not_idle</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>can_bus_idle</name>
                  <description>CAN bus is now IDLE.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXWRN</name>
              <description>Rx Error Warning</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXERRCNT_LT_96</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXERRCNT_GTE_96</name>
                  <description>RXERRCNT is greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXWRN</name>
              <description>TX Error Warning</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXERRCNT_LT_96</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXERRCNT_GTE_96</name>
                  <description>TXERRCNT is greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STFERR</name>
              <description>Stuffing Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stuffing_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>stuffing_error_yes</name>
                  <description>A stuffing error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMERR</name>
              <description>Form Error</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>form_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>form_error_yes</name>
                  <description>A Form Error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCERR</name>
              <description>Cyclic Redundancy Check Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_error_yes</name>
                  <description>A CRC error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKERR</name>
              <description>Acknowledge Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_error_yes</name>
                  <description>An ACK error occurred since last read of this register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT0ERR</name>
              <description>Bit0 Error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit0_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit0_error_yes</name>
                  <description>At least one bit sent as dominant is received as recessive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT1ERR</name>
              <description>Bit1 Error</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bit1_error_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit1_error_yes</name>
                  <description>At least one bit sent as recessive is received as dominant.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWRNINT</name>
              <description>Rx Warning Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Rx_warning_int_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx_warning_int_yes</name>
                  <description>The Rx error counter transitioned from less than 96 to greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWRNINT</name>
              <description>Tx Warning Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Tx_warning_int_no</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx_warning_int_yes</name>
                  <description>The Tx error counter transitioned from less than 96 to greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCH</name>
              <description>CAN Synchronization Status</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_bus_sync_no</name>
                  <description>FlexCAN is not synchronized to the CAN bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_bus_sync_yes</name>
                  <description>FlexCAN is synchronized to the CAN bus.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOFFDONEINT</name>
              <description>Bus Off Done Interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bus_off_not_done</name>
                  <description>No such occurrence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bus_off_done</name>
                  <description>FlexCAN module has completed Bus Off process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERROVR</name>
              <description>Error Overrun</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>overrun_not_occurred</name>
                  <description>Overrun has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overrun_occurred</name>
                  <description>Overrun has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IMASK1</name>
          <description>Interrupt Masks 1 Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUF15TO0M</name>
              <description>Buffer MBi Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFLAG1</name>
          <description>Interrupt Flags 1 Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>BUF0I</name>
              <description>Buffer MB0 Interrupt Or Clear FIFO bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>buffer_Tx_Rx_not_complete</name>
                  <description>The corresponding buffer has no occurrence of successfully completed transmission or reception when MCR[RFEN]=0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>buffer_Tx_Rx_complete</name>
                  <description>The corresponding buffer has successfully completed transmission or reception when MCR[RFEN]=0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF4TO1I</name>
              <description>Buffer MBi Interrupt Or Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BUF5I</name>
              <description>Buffer MB5 Interrupt Or Frames available in Rx FIFO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id2</name>
                  <description>No occurrence of MB5 completing transmission/reception when MCR[RFEN]=0, or of frame(s) available in the FIFO, when MCR[RFEN]=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id4</name>
                  <description>MB5 completed transmission/reception when MCR[RFEN]=0, or frame(s) available in the Rx FIFO when MCR[RFEN]=1. It generates a DMA request in case of MCR[RFEN] and MCR[DMA] are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF6I</name>
              <description>Buffer MB6 Interrupt Or Rx FIFO Warning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id2</name>
                  <description>No occurrence of MB6 completing transmission/reception when MCR[RFEN]=0, or of Rx FIFO almost full when MCR[RFEN]=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id4</name>
                  <description>MB6 completed transmission/reception when MCR[RFEN]=0, or Rx FIFO almost full when MCR[RFEN]=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF7I</name>
              <description>Buffer MB7 Interrupt Or Rx FIFO Overflow</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id2</name>
                  <description>No occurrence of MB7 completing transmission/reception when MCR[RFEN]=0, or of Rx FIFO overflow when MCR[RFEN]=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id4</name>
                  <description>MB7 completed transmission/reception when MCR[RFEN]=0, or Rx FIFO overflow when MCR[RFEN]=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUF15TO8I</name>
              <description>Buffer MBi Interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
