renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/7_SPI_driver/Examples/SPI_Example4_SyncTxRx_2Ch_2Job_1Seq/Autosar/Mcal/Base/header/S32K142_M4.svd
        <register>
          <name>SWOCTRL</name>
          <description>FTM Software Output Control</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0OC</name>
              <description>Channel 0 Software Output Control Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OC</name>
              <description>Channel 1 Software Output Control Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OC</name>
              <description>Channel 2 Software Output Control Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OC</name>
              <description>Channel 3 Software Output Control Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OC</name>
              <description>Channel 4 Software Output Control Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OC</name>
              <description>Channel 5 Software Output Control Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OC</name>
              <description>Channel 6 Software Output Control Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OC</name>
              <description>Channel 7 Software Output Control Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7OC_0</name>
                  <description>The channel output is not affected by software output control.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7OC_1</name>
                  <description>The channel output is affected by software output control.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH0OCV</name>
              <description>Channel 0 Software Output Control Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1OCV</name>
              <description>Channel 1 Software Output Control Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2OCV</name>
              <description>Channel 2 Software Output Control Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3OCV</name>
              <description>Channel 3 Software Output Control Value</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4OCV</name>
              <description>Channel 4 Software Output Control Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5OCV</name>
              <description>Channel 5 Software Output Control Value</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6OCV</name>
              <description>Channel 6 Software Output Control Value</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7OCV</name>
              <description>Channel 7 Software Output Control Value</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7OCV_0</name>
                  <description>The software output control forces 0 to the channel output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7OCV_1</name>
                  <description>The software output control forces 1 to the channel output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMLOAD</name>
          <description>FTM PWM Load</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0SEL</name>
              <description>Channel 0 Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH0SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1SEL</name>
              <description>Channel 1 Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH1SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2SEL</name>
              <description>Channel 2 Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH2SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3SEL</name>
              <description>Channel 3 Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH3SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4SEL</name>
              <description>Channel 4 Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH4SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5SEL</name>
              <description>Channel 5 Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH5SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6SEL</name>
              <description>Channel 6 Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH6SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH6SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7SEL</name>
              <description>Channel 7 Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH7SEL_0</name>
                  <description>Channel match is not included as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH7SEL_1</name>
                  <description>Channel match is included as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCSEL</name>
              <description>Half Cycle Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCSEL_0</name>
                  <description>Half cycle reload is disabled and it is not considered as a reload opportunity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCSEL_1</name>
                  <description>Half cycle reload is enabled and it is considered as a reload opportunity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOK</name>
              <description>Load Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOK_0</name>
                  <description>Loading updated values is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOK_1</name>
                  <description>Loading updated values is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLEN</name>
              <description>Global Load Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLEN_0</name>
                  <description>Global Load Ok disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLEN_1</name>
                  <description>Global Load OK enabled. A pulse event on the module global load input sets the LDOK bit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLDOK</name>
              <description>Global Load OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLDOK_0</name>
                  <description>No action.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLDOK_1</name>
                  <description>LDOK bit is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
