renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/7_SPI_driver/Examples/SPI_Example4_SyncTxRx_2Ch_2Job_1Seq/Autosar/Mcal/Base/header/S32K142_M4.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFBYS[%s]</name>
          <description>Shifter Buffer N Byte Swapped Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBYS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFBBS[%s]</name>
          <description>Shifter Buffer N Bit Byte Swapped Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFBBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCTL[%s]</name>
          <description>Timer Control N Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMOD</name>
              <description>Timer Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMOD_0</name>
                  <description>Timer Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMOD_1</name>
                  <description>Dual 8-bit counters baud mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMOD_2</name>
                  <description>Dual 8-bit counters PWM high mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMOD_3</name>
                  <description>Single 16-bit counter mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOL</name>
              <description>Timer Pin Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINPOL_0</name>
                  <description>Pin is active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINPOL_1</name>
                  <description>Pin is active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Timer Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINCFG</name>
              <description>Timer Pin Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINCFG_0</name>
                  <description>Timer pin output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINCFG_1</name>
                  <description>Timer pin open drain or bidirectional output enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINCFG_2</name>
                  <description>Timer pin bidirectional output data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINCFG_3</name>
                  <description>Timer pin output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRGSRC_0</name>
                  <description>External trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGSRC_1</name>
                  <description>Internal trigger selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPOL</name>
              <description>Trigger Polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRGPOL_0</name>
                  <description>Trigger active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRGPOL_1</name>
                  <description>Trigger active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCFG[%s]</name>
          <description>Timer Configuration N Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTART</name>
              <description>Timer Start Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSTART_0</name>
                  <description>Start bit disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTART_1</name>
                  <description>Start bit enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Timer Stop Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSTOP_0</name>
                  <description>Stop bit disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTOP_1</name>
                  <description>Stop bit is enabled on timer compare</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTOP_2</name>
                  <description>Stop bit is enabled on timer disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTOP_3</name>
                  <description>Stop bit is enabled on timer compare and timer disable</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMENA</name>
              <description>Timer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMENA_0</name>
                  <description>Timer always enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_1</name>
                  <description>Timer enabled on Timer N-1 enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_2</name>
                  <description>Timer enabled on Trigger high</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_3</name>
                  <description>Timer enabled on Trigger high and Pin high</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_4</name>
                  <description>Timer enabled on Pin rising edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_5</name>
                  <description>Timer enabled on Pin rising edge and Trigger high</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_6</name>
                  <description>Timer enabled on Trigger rising edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMENA_7</name>
                  <description>Timer enabled on Trigger rising or falling edge</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDIS</name>
              <description>Timer Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMDIS_0</name>
                  <description>Timer never disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDIS_1</name>
                  <description>Timer disabled on Timer N-1 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDIS_2</name>
                  <description>Timer disabled on Timer compare (upper 8-bits match and decrement)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDIS_3</name>
                  <description>Timer disabled on Timer compare (upper 8-bits match and decrement) and Trigger Low</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDIS_4</name>
                  <description>Timer disabled on Pin rising or falling edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDIS_5</name>
                  <description>Timer disabled on Pin rising or falling edge provided Trigger is high</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDIS_6</name>
                  <description>Timer disabled on Trigger falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMRST</name>
              <description>Timer Reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMRST_0</name>
                  <description>Timer never reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMRST_2</name>
                  <description>Timer reset on Timer Pin equal to Timer Output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMRST_3</name>
                  <description>Timer reset on Timer Trigger equal to Timer Output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMRST_4</name>
                  <description>Timer reset on Timer Pin rising edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMRST_6</name>
                  <description>Timer reset on Trigger rising edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMRST_7</name>
                  <description>Timer reset on Trigger rising or falling edge</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDEC</name>
              <description>Timer Decrement</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMDEC_0</name>
                  <description>Decrement counter on FlexIO clock, Shift clock equals Timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDEC_1</name>
                  <description>Decrement counter on Trigger input (both edges), Shift clock equals Timer output.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDEC_2</name>
                  <description>Decrement counter on Pin input (both edges), Shift clock equals Pin input.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMDEC_3</name>
                  <description>Decrement counter on Trigger input (both edges), Shift clock equals Trigger input.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timer Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMOUT_0</name>
                  <description>Timer output is logic one when enabled and is not affected by timer reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMOUT_1</name>
                  <description>Timer output is logic zero when enabled and is not affected by timer reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMOUT_2</name>
                  <description>Timer output is logic one when enabled and on timer reset</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMOUT_3</name>
                  <description>Timer output is logic zero when enabled and on timer reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCMP[%s]</name>
          <description>Timer Compare N Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
